# üêç SQL in Python üêç

This file intends to execute SQL queries in Python reading them from a script.

### 1Ô∏è‚É£ Importing the required libraries

In [1]:
import pandas as pd
import mysql.connector

### 2Ô∏è‚É£ Setting connection and cursor

In [2]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab', host='127.0.0.1', database='sakila')

In [3]:
mycursor = cnx.cursor()

### 3Ô∏è‚É£ Opening the SQL script

In [4]:
with open("files/script.sql", "r") as file:
    sql_script = file.read()

In [5]:
results = [] # This list will cointain the sql queries outputs 
for query in sql_script.split(";"):
    mycursor.execute(query)
    results.append(mycursor.fetchall())

### 4Ô∏è‚É£ Creating DataFrames for some outputs

First, we need to delete the empty results

In [6]:
for result in results:
    if len(result) == 0:
        results.remove(result)

Now, let's choose the last result and convert it to a DataFrame:

In [7]:
df = pd.DataFrame(results[-1])

In [8]:
df.sample(10)

                     0               1  2
8911      albert nolte   alan dreyfuss  1
7948   penelope cronyn     adam hopper  2
1546      fred costner  gina degeneres  1
8748      liza bergman    gene hopkins  1
2397       kevin bloom     tim hackman  1
10138      mena hopper     burt temple  1
3321      burt dukakis       meg hawke  1
8833    julianne dench   audrey bailey  1
7760      spencer depp     meryl allen  1
5696        mary tandy    sean guiness  1

This can also be done using the `read_sql_query()` pandas method. To do so, we use the sql_script variable and remove the blank spaces in the query.

In [9]:
my_queries_list = sql_script.split(";")
clean_queries = []

for query in my_queries_list:
    query = query.strip()
    if len(query) != 0:
        clean_queries.append(query)

Now, we can convert the queries into DataFrames

In [10]:
df_2 = pd.read_sql_query(clean_queries[-1], cnx)

C:\Users\maria\AppData\Local\Temp\ipykernel_25476\1034347106.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_2 = pd.read_sql_query(clean_queries[-1], cnx)

In [11]:
df_2.sample(10)

                  actor_1           actor_2  films_together
637          grace mostel    gina degeneres               2
2988          tim hackman     minnie kilmer               1
456   johnny lollobrigida        dan harris               1
4976           dan harris      greg chaplin               1
9198         richard penn         emily dee               3
7236    christopher berry  olympia pfeiffer               4
4193      parker goldberg   natalie hopkins               1
4962           dan harris     dustin tautou               1
4777     penelope pinkett     debbie akroyd               2
9102         greta keitel      meryl gibson               1

### 5Ô∏è‚É£ Create csv file from DataFrame

Using the `to_csv()` pandas method, we can save the outputs in a `.csv` file.

In [12]:
df_2.to_csv("files/bonus_query_out.csv")

In [13]:
cnx.close()